Aim:
1) Provide summery statistics for a dataset with numeric varibles grouped by one
of the qualitative variables.
2) write a python program to display some basic statistical details like percentile,
mean, standard devivation , etc.

In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('student.csv')

In [3]:
df

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajunkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [4]:
df.mean()
#mean

C:\Users\Sanu Deokar\AppData\Local\Temp\ipykernel_16320\2324897766.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

roll      5.500000
marks    63.915000
age      20.555556
dtype: float64

In [5]:
df.median()
#median

C:\Users\Sanu Deokar\AppData\Local\Temp\ipykernel_16320\3750896793.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

roll      5.500
marks    61.525
age      20.000
dtype: float64

In [6]:
#standarad deviation
df.std()

C:\Users\Sanu Deokar\AppData\Local\Temp\ipykernel_16320\2682428387.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

roll      3.027650
marks    10.315294
age       1.333333
dtype: float64

In [7]:
df.min()
#min

C:\Users\Sanu Deokar\AppData\Local\Temp\ipykernel_16320\2848831385.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.min()

roll           1
name     ajunkya
marks      49.55
age         19.0
dtype: object

In [8]:
df.max()
#max

C:\Users\Sanu Deokar\AppData\Local\Temp\ipykernel_16320\3883171465.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

roll         10
name     ayesha
marks     78.66
age        23.0
dtype: object

In [9]:
import numpy as np

In [10]:
np.std(df['marks'])

9.649073789747904

In [11]:
gr1 = df.groupby('class')

In [12]:
te = gr1.get_group('TE')

In [13]:
te.min()

roll           1
name     ajunkya
class         TE
marks      56.75
age         20.0
dtype: object

In [14]:
te.max()

roll         9
name      anil
class       TE
marks    69.66
age       22.0
dtype: object

In [15]:
gr2 = df.groupby('age')

In [16]:
gr2.groups

{19.0: [2, 6], 20.0: [4, 5, 8], 21.0: [1, 9], 22.0: [0], 23.0: [7]}

In [17]:
tw = gr2.get_group(20)

In [18]:
tw

   roll    name class  marks   age
4     5    asha   NaN  63.28  20.0
5     6  ayesha    BE  49.55  20.0
8     9    amol    TE  56.75  20.0

In [19]:
import seaborn as sns

In [20]:
df = sns.load_dataset('iris')

In [21]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [22]:
df = px.data.iris()

NameError: name 'px' is not defined

In [23]:
#https://mitu.co.in
df=pd.read_csv('iris.csv')
df
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [33]:
gr = df.groupby('Species')

In [26]:
se = gr.get_group('Iris-setosa')
ve = gr.get_group('Iris-versicolor')
vi = gr.get_group('Iris-virginica')

In [27]:
se.shape

(50, 6)

In [28]:
ve.shape

(50, 6)

In [29]:
vi.shape

(50, 6)

In [30]:
se.describe()

             Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  50.00000       50.00000     50.000000      50.000000      50.00000
mean   25.50000        5.00600      3.418000       1.464000       0.24400
std    14.57738        0.35249      0.381024       0.173511       0.10721
min     1.00000        4.30000      2.300000       1.000000       0.10000
25%    13.25000        4.80000      3.125000       1.400000       0.20000
50%    25.50000        5.00000      3.400000       1.500000       0.20000
75%    37.75000        5.20000      3.675000       1.575000       0.30000
max    50.00000        5.80000      4.400000       1.900000       0.60000

In [31]:
ve.describe()

              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000      50.000000     50.000000      50.000000     50.000000
mean    75.50000       5.936000      2.770000       4.260000      1.326000
std     14.57738       0.516171      0.313798       0.469911      0.197753
min     51.00000       4.900000      2.000000       3.000000      1.000000
25%     63.25000       5.600000      2.525000       4.000000      1.200000
50%     75.50000       5.900000      2.800000       4.350000      1.300000
75%     87.75000       6.300000      3.000000       4.600000      1.500000
max    100.00000       7.000000      3.400000       5.100000      1.800000

In [32]:
vi.describe()

              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000       50.00000     50.000000      50.000000      50.00000
mean   125.50000        6.58800      2.974000       5.552000       2.02600
std     14.57738        0.63588      0.322497       0.551895       0.27465
min    101.00000        4.90000      2.200000       4.500000       1.40000
25%    113.25000        6.22500      2.800000       5.100000       1.80000
50%    125.50000        6.50000      3.000000       5.550000       2.00000
75%    137.75000        6.90000      3.175000       5.875000       2.30000
max    150.00000        7.90000      3.800000       6.900000       2.50000